{
  "backend/main.mo": "Defines an actor with a pushLive method that performs no backend logic.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend components and content files.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables for light/dark modes with global theming.",
  "frontend/index.html": "Basic HTML shell loading the React app entry point into the root div.",
  "frontend/src/App.tsx": "Renders ValentinePage and triggers optional pushLive behavior via a custom hook.",
  "frontend/src/components/valentine/ClosingSection.tsx": "Closing section with Yes button and a movable No button constrained within its container.",
  "frontend/src/components/valentine/ConfettiBurst.tsx": "Canvas animation that bursts falling confetti for a short timed duration.",
  "frontend/src/components/valentine/CursorHeartsTrail.tsx": "Canvas-based particle system generating drifting heart particles following cursor or touch.",
  "frontend/src/components/valentine/FloatingHearts.tsx": "Generates floating heart images that animate upward with random positions and timings.",
  "frontend/src/components/valentine/GirlfriendPhotoSection.tsx": "Empty placeholder component file.",
  "frontend/src/components/valentine/HeroSection.tsx": "Hero section displaying background imagery, title, subtitle, and a scroll CTA with decorative hearts.",
  "frontend/src/components/valentine/LoveLetterSection.tsx": "Renders a love letter section using content from valentineContent with styled text and a decorative heart image.",
  "frontend/src/components/valentine/MemoryLaneSection.tsx": "Displays an uploadable photo grid with captions, allowing up to five images and managing uploads via FileReader.",
  "frontend/src/components/valentine/PlaylistSection.tsx": "Shows a playlist section with title, subtitle, and an embedded Spotify playlist from valentineContent.",
  "frontend/src/components/valentine/ReasonsSection.tsx": "Renders a grid of cards listing reasons from valentineContent.reasons with heart icons and animations.",
  "frontend/src/components/valentine/SectionShell.tsx": "Provides a layout wrapper component that applies consistent section padding and max-width styling.",
  "frontend/src/components/valentine/SeparateMessageSection.tsx": "Displays a special message section with paragraphs from valentineContent and decorative animated emojis.",
  "frontend/src/components/valentine/SweetResponseModal.tsx": "Modal dialog showing a closing response message using valentineContent with animated heart emoji.",
  "frontend/src/components/valentine/ValentinePage.tsx": "Assembles all Valentine sections, manages the response modal state, and triggers floating hearts on CTA click.",
  "frontend/src/components/valentine/VirtualGiftBoxSection.tsx": "Handles an interactive gift box that reveals coupon content after an animation with optional confetti.",
  "frontend/src/content/valentineContent.ts": "Central content config storing all text, titles, captions, and options used throughout the Valentine page.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on the current Internet Identity, invalidating related queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, stored identities, and status tracking through an AuthClient.",
  "frontend/src/hooks/usePushLiveOnDemand.ts": "Checks for a pushLive query param and triggers actor.pushLive() once when available.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file for future React Query hooks; currently exports nothing.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, Valentine-themed color variables, fonts, and custom animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors mapped to CSS variables, animations, fonts, and plugin integrations.",
  "project_state.json": "Stores the project’s configuration, feature requirements, design notes, and known issues for the Valentine website."
}